Repository: DislikesSchool/EduPage2
Catalog: lib/l10n/app_*.arb
Languages: cs, de, sk

source: Loading
cs: Načítání
sk: Načítava sa

# mainHome
source: Home
cs: Domů
sk: Domov

# mainTimetable
source: Time table
cs: Rozvrh
de: Zeitplan
sk: Rozvrh

# mainMessages
source: Messages
cs: Zprávy
de: Nachrichten
sk: Správy

# mainHomework
source: Homework
cs: Úkoly
de: Hausaufgaben
sk: Úlohy

# mainGrades
source: Grades
cs: Známky
de: Noten
sk: Známky

# homeLunchesNotLoaded
source: Could not load lunches
cs: Obědy nebyly načteny
de: Konnte das Essen nicht Laden
sk: Obedy neboli načítané

# homeNoLunchToday
source: You don't have any lunch for today
cs: Na dnešek nemáš objednaný oběd
de: Du hast für Heute kein Essen geplant
sk: Na dnešný deň nemáš objednaný obed

# homeLunchToday
source: You have lunch option number {lunch}
cs: Dneska máš oběd číslo {lunch}
de: Sie haben die Möglichkeit, zu Mittag zu essen {lunch}
sk: Dnes máš obed číslo {lunch}

# homeLunchDontForget
source: Don't forget to order lunch for {date}
cs: Nezapomeň si objednat oběd na {date}
de: Vergiss nicht dein essen zu Bestellen für den {date}
sk: Nezabudni si objednať obed na {date}

# homeLogout
source: Logout
cs: Odhlásit se
de: Abmelden
sk: Odhlásiť sa

# homeSetupICanteen
source: Setup iCanteen
cs: Nastavit iCanteen
de: iCanteen einrichten
sk: Nastaviť iCanteen

# homeNoClasses
source: No school today :D
cs: Dneska nemáš skolu! :D
de: Heute ist keine Schule :D
sk: Dnes nemáš školu! :D

# homeUpdateTitle
source: New version available
cs: Nová verze dostupná
de: Neue Version Verfügbar
sk: Nová verzia dostupná

# homeUpdateDescription
source: Please visit https://github.com/DislikesSchool/EduPage2/releases to download the latest version
cs: Prosím navštivte https://github.com/DislikesSchool/EduPage2/releases pro nejnovější verzi
de: Bitte besuchen Sie https://github.com/DislikesSchool/EduPage2/releases, um die neueste Version herunterzuladen
sk: Prosím navštívte https://github.com/DislikesSchool/EduPage2/releases pre najnovšiu verziu

# homeQuickstart
source: QuickStart
cs: Rychlý start
de: Schnell Stark
sk: Rýchly štart

# homePreview
source: Preview
cs: Náhled
de: Vorschau
sk: Náhľad

# homePatchAvailable
source: Installing new patch…
cs: Instaluje se nový patch…
de: Installiere Neuen Patch…
sk: Inštaluje sa nový patch…

# homePatchDownloaded
source: Patch downloaded, please restart EduPage2
cs: Patch byl stažen, restartujte aplikaci pro instalaci
de: Patch heruntergeladen, Bitte starte die App neu um ihn zu Installieren
sk: Patch bol stiahnutý, pre nainštalovanie reštartujte aplikáciu

# homeGrades
source: Grades
cs: Známky
de: Noten
sk: Známky

# homeHomework
source: Homework
cs: Úkoly
de: Hausaufgaben
sk: Úlohy

# homeworkTitle
source: Homework
cs: Domácí úkoly
de: Hausaufgaben
sk: Domáce úlohy

# messagesTitle
source: Messages
cs: Zprávy
de: Nachrichten
sk: Správy

# loginPleaseLogin
source: Please login to EduPage2
cs: Přihlašte se prosím
de: Bitte melde dich bei Edupage2 an
sk: Prihláste sa prosím

# loginUseExistingCredentials
source: Use your existing EduPage credentials
cs: Použijte svoje existující přihlašovací údaje
de: Nutze deine Existierenden Edupage Anmelde Daten
sk: Použite svoje existujúce prihlasovacie údaje

# loginUsername
source: Username
cs: Přihlašovací jméno
de: Nutzername
sk: Prihlasovacie meno

# loginPassword
source: Password
cs: Heslo
sk: Heslo

# loginServer
source: Server (e.g., school.edupage.org)
cs: Server (např. skola.edupage.org)
de: Server (z. B. Schule.edupage.org)
sk: Server (napr. skola.edupage.org)

# loginLogin
source: Login
cs: Přihlásit se
de: Anmelden
sk: Prihlásiť sa

# loginCustomEndpointCheckbox
source: Use custom endpoint
cs: Použít valstní endpoint
de: Benutzerdefinierten Endpunkt verwenden
sk: Použiť valstný endpoint

# loginCustomEndpoint
source: Enter custom endpoint URL
cs: URL vlastního endpointu
de: Benutzerdefinierte Endpunkt-URL eingeben
sk: URL vlastného endpointu

# loginDemoButton
source: Or try the demo
cs: Anebo si prohledněte demo
de: Oder Benutzte die Demo Version
sk: Alebo si pozrite demo

source: Today
cs: Dnes
sk: Dnes

source: Tomorrow
cs: Zítra
sk: Zajtra

# timetableTeacher
source: {count, plural, =1{Teacher} other{{count} Teachers}}
cs: {count, plural, =1{Učitel} few{{count} Učitelé} other{{count} Učitelů}}
sk: {count, plural, =1{Učiteľ} few{{count} Učitelia} other{{count} Učiteľov}}

# loadCredentials
source: Loading credentials…
cs: Načítání přihlašovacích údajů…
sk: Načítavanie prihlasovacích údajov…

# loadLoggingIn
source: Logging in…
cs: Přihlašování…
sk: Prihlasovanie…

# loadLoggedIn
source: Logged in
cs: Přihlášeno
sk: Prihlásené

# loadAccessToken
source: Getting access token…
cs: Získávání přihlašovacího tokenu…
sk: Získavanie prihlasovacieho tokenu…

# loadVerify
source: Verifying
cs: Ověřování
sk: Overovanie

# loadDownloadTimetable
source: Downloading time table…
cs: Stahování rozvrhu…
sk: Sťahovanie rozvrhu…

# loadDownloadGrades
source: Downloading grades…
cs: Stahování známek…
sk: Sťahovanie známok…

# loadDownloadMessages
source: Downloading messages…
cs: Stahování zpráv…
sk: Sťahovanie správ…

# loadDone
source: Done!
cs: Hotovo!
sk: Hotovo!

# loadError
source: Error
cs: Chyba
sk: Chyba

# loadErrorDescription
source: There was an error loading data. This error has been reported.
cs: Při načítání dat došlo k chybě. Tato chyba byla nahlášena.
sk: Při načítavaní dát došlo k chybe. Tato chyba byla nahlásena.

# iCanteenLoading
source: Loading lunches (this could take a while)
cs: Načítání obědů (tohle by mohlo chvíli zabrat)
sk: Načítavanie obedov (toto môže chvíľu trvať)

# iCanteenCantLoad
source: Unable to load lunches
cs: Nelze načst obědy
sk: Nepodarilo sa načítať obedy

# iCanteenSetupPleaseLogin
source: Login to iCanteen
cs: Přihlašte se do systému iCanteen
sk: Prihláste sa do systému iCanteen

# iCanteenSetupDetails
source: URL address in this format: https://lunches.yourschool.com/login
cs: Adresu URL zadejte ve formátu https://stravovani.skola.cz/login
sk: Adresu URL zadajte ve formáte https://stravovanie.skola.sk/login

# iCanteenSetupServer
source: Server address
cs: Adresa URL
sk: Adresa URL

# iCanteenSetupEmail
source: Username
cs: Přihlašovací jméno
sk: Prihlasovacie meno

# iCanteenSetupPassword
source: Password
cs: Heslo
sk: Heslo

# iCanteenSetupError
source: There was an error logging in
cs: Nastala chyba při příhlášení
sk: Nastala chyba pri prihlasovaní

# messagesLoadingAttachment
source: Loading pdf…
cs: Načítání pdf souboru…
sk: Načítavanie pdf súboru…

# messagesAttachments
source: {count, plural, =1{1 Attachment} other{{count} Attachments}}
cs: {count, plural, =1{1 Přípona} few{{count} Přípony} other{{count} Přípon}}
sk: {count, plural, =1{1 Prípona} few{{count} Prípony} other{{count} Prípon}}

# messagesPoll
source: Poll
cs: Anketa
sk: Anketa

# createMessageDiscard
source: Discard message?
cs: Zahodit zprávu?
sk: Zahodiť správu?

# createMessageDiscardDescription
source: The message has not been sent yet. Are you sure you want to discard it?
cs: Zpráva ještě nebyla odeslána. Opravdu ji chcete zahodit?
sk: Správa ešte nebola odoslaná. Naozaj ju chcete zahodiť ?

# createMessageDiscardCancel
source: Cancel
cs: Zrušit
sk: Zrušiť

# createMessageDiscardDiscard
source: Discard
cs: Zahodit
sk: Zahodiť

# createMessageTitle
source: New message
cs: Nová zpráva
sk: Nová správa

# createMessageSelectRecipient
source: Select recipient
cs: Vyberte příjemce
sk: Vyberte príjemcu

# createMessageMessageHere
source: Your message here
cs: Vaše zpráva zde
sk: Vaša správa tu

# createMessageImportant
source: Important
cs: Důležité
sk: Dôležité

# createMessageIncludePoll
source: Include poll
cs: Vložit anketu
sk: Vložiť anketu

# createMessagePollEnableMultiple
source: Allow multiple answers
cs: Povolit více odpovědí
sk: Povoliť viac odpovedí

# createMessageNewPollOptionPlaceholder
source: New option
cs: Nová možnost
sk: Nová možnosť

# createMessageErrorSelectRecipient
source: Please select a recipient
cs: Vyberte prosím příjemce
sk: Vyberte prosím príjemcu

# createMessageErrorNoMessage
source: Please write a message
cs: Napište prosím zprávu
sk: Napíšte prosím správu

# createMessageSend
source: Send
cs: Odeslat
sk: Odoslať

# createMessageNotifSending
source: Sending message
cs: Odesílání zprávy
sk: Odosielanie správy

# createMessageNotifSendingBody
source: Your message is being sent…
cs: Vaše zpráva se odesílá…
sk: Vaša správa sa odosiela…

# createMessageNotifSent
source: Sent message
cs: Zpráva odeslána
sk: Správa odoslaná

# createMessageNotifSentBody
source: Your message was sent successfully
cs: Vaše zpráva se odeslala úspěšně
sk: Vaše správa bola úspešne odoslaná

# createMessageNotifError
source: Error
cs: Chyba
sk: Chyba

# createMessageNotifErrorBody
source: There was an issue sending your message, it has been reported!
cs: Při odesílání zprávy se vyskytla chyba, tato chyba byla nahlášena!
sk: Pri odosielaní správy sa vyskytla chyba, táto chyba bola nahlásená!

# qrLoginPleaseLogin
source: EduPage2 QR Login
cs: EduPage2 QR Přihlášení
sk: EduPage2 QR Prihlásenie

# qrLoginUseExistingCredentials
source: You are about to login to EduPage2 using a QR code
cs: Chystáte se přihlásit pomocí QR kódu
sk: Chystáte sa prihlásiť pomocou QR kódu

# gradesTitle
source: Grades
cs: Známky
sk: Známky

# messagesSearchTitle
source: Search messages
cs: Prohledat zprávy
sk: Hľadať správy

# messagesSearchHint
source: Enter search term…
cs: Zadejte hledaný výraz…
sk: Vložte vyhľadávací pojem…

# messagesNoResults
source: No results found
cs: Nebyly nalezeny žádné výsledky
sk: Nenašli sa žiadne výsledky

# messagesSearchInstructions
source: Enter a search term above
cs: Zadejte vyhledávací výraz výše
sk: Vyššie zadajte hľadaný pojem

# setupWelcomeTitle
source: Welcome to EduPage2
cs: Vítejte v EduPage2
de: Willkommen auf Edupage2
sk: Vitaj v EduPage2

# loginInvalidCredentials
source: Invalid username or password
cs: Neplatné uživatelské jméno nebo heslo
de: Ungültiger Benutzername oder Passwort
sk: Neplatné meno alebo heslo

# setupFeatureSearch
source: Full-text search
sk: Fulltextové vyhľadávanie

# setupDataStoragePrivacyDetails
source: The EduPage2 server stores data securely and in an encrypted manner on a private dedicated server. No data is shared with any external parties.
sk: Server EduPage2 ukladá dáta bezpečne a šifrovane na súkromnom dedikovanom serveri. Žiadne údaje sa nezdieľajú so žiadnymi externými stranami.

# setupQuickStartTitle
source: Quick Start
cs: Rychlý start
de: Schnell Start
sk: Rýchly štart

# loginServerOptional
source: Server is optional, but might help if you are unable to login and are sure you have the correct credentials
cs: Server není vyžadován, ale může pomoci, když se nemůžete přihlásit a jste si jist(á), že jste zadal(a) správné přihlašovací údaje
de: Der Server ist optional, kann jedoch hilfreich sein, wenn Sie sich nicht anmelden können und sicher sind, dass Sie über die richtigen Anmeldedaten verfügen
sk: Server zadajte ak sa nemôžete prihlásiť a ste si istí, že máte správne prihlasovacie údaje

# setupWelcomeBody
source: EduPage2 is a modern client for Edupage focusing on speed, efficiency and user experience. EduPage2 is fully open-source and free to use. Make sure to join our Discord server for news and updates.
cs: EduPage2 je moderní klient pro EduPage zaměřený na rychlost, efektivitu a uživatelský zážitek. EduPage2 je plně open-source a volně k použití. Připojte se na náš Discord server pro příjem novinek.
de: EduPage2 ist ein moderner Client für Edupage, der sich auf Geschwindigkeit, Effizienz und Benutzerfreundlichkeit konzentriert. EduPage2 ist vollständig Open Source und kostenlos nutzbar. Treten Sie unserem Discord-Server bei, um Neuigkeiten und Updates zu erhalten
sk: EduPage2 je moderný klient pre Edupage zameraný na rýchlosť, efektivitu a použiteľnosť. EduPage2 je plne open-source. Nezabudni sa pripojiť na náš Discord server pre novinky a aktualizácie.

# setupDataStoragePrivacyDetailsUnencrypted
source: The server that you are connecting to does not encrypt your data. We would recommend either enabling encryption on the server, or using the official EduPage2 server to store your data securely.
sk: Server, ku ktorému sa pripájaš, nešifruje tvoje údaje. Odporúčame ti buď povoliť šifrovanie na serveri, alebo použiť oficiálny server EduPage2 na bezpečné ukladanie vašich údajov.

source: Logging in...
cs: Přihlašování…
de: Anmeden....
sk: Prihlasujem...

# loginCredentialsRequired
source: Username and password are required
cs: Uživatelské jméno a heslo jsou požadovány
de: Benutzername und Passwort sind erforderlich
sk: Meno a heslo musia byť zadané

# setupQuickStartExplanation
source: Experimental feature to greatly speed up app loading times.
cs: Experimentální funkce která může znatelně zrychlit start aplikace.
de: Experimentelle Funktion zur Beschleunigung der App Ladezeiten
sk: Experimentálna funkcia na výrazné zrýchlenie štartu aplikácie.

# setupQuickStartEnable
source: Enable Quick Start
cs: Zapnout Rychlý Start
de: Schnellstart aktivieren
sk: Povoliť rýchly štart

# setupQuickStartDetails
source: Enabling Quick Start will make the app prefer cached data over fetching data from the server. This can be disabled later.
cs: Při povolení Rychlého startu aplikace preferuje data z mezipaměti před získáváním dat ze serveru. Toto může být později zakázáno.
de: Durch Aktivieren von „Schnellstart“ bevorzugt die App zwischengespeicherte Daten gegenüber Daten, die vom Server abgerufen werden. Diese Option kann im Nachhinein deaktiviert werden.
sk: Po povolení rýchleho spustenia bude aplikácia uprednostňovať údaje uložené vo vyrovnávacej pamäti pred načítaním údajov zo servera. Toto je možné neskôr deaktivovať.

# setupQuickStartInfo
source: Quick Start is still experimental
cs: Rychlý start je stále experimentální
de: Schnellstart Ist immernoch Experimentell
sk: Rýchly štart je stále experimentálny

# setupQuickStartBenefits
source: Quick Start will make the app start nearly instant, and fetch data from the server in the background, as opposed to waiting for the server to respond.
de: Mit „Schnellstart“ wird die App fast sofort gestartet und ruft Daten im Hintergrund vom Server ab, anstatt auf die Antwort des Servers zu warten.
sk: Rýchly štart spôsobí, že sa aplikácia spustí takmer okamžite a načíta údaje zo servera na pozadí, namiesto čakania na odpoveď servera.

# setupQuickStartDrawbacks
source: While this speeds up the initial loading time, it may lead to outdated data being displayed briefly.
de: Dies beschleunigt zwar die anfängliche Ladezeit, kann jedoch dazu führen, dass kurzzeitig veraltete Daten angezeigt werden.
sk: Aj keď sa tým zrýchli počiatočný čas načítania, môže to viesť ku krátkemu zobrazeniu starých údajov.

# setupDataStorageTitle
source: Data Storage
de: Datenspeicherung
sk: Úložisko dát

# setupDataStorageExplanation
source: EduPage2 has can optionally store some user data on the EduPage2 server to provide advanced functionality. The app will work fine without it, but some features may be limited.
de: EduPage2 kann optional einige Benutzerdaten auf dem EduPage2-Server speichern, um erweiterte Funktionen bereitzustellen. Die App funktioniert auch ohne diese Speicherung einwandfrei, jedoch können einige Funktionen eingeschränkt sein.
sk: EduPage2 môže voliteľne ukladať niektoré používateľské údaje na server EduPage2, aby poskytoval pokročilé funkcie. Aplikácia bude fungovať aj bez toho, ale niektoré funkcie môžu byť obmedzené.

# setupDataStorageDisabled
source: Server storage is disabled
de: Der Serverspeicher ist deaktiviert
sk: Ukladanie dát na serveri je vypnuté

# setupDataStorageDisabledExplanation
source: Server storage is disabled on the EduPage2 server instance that you are connecting to.
de: Der Serverspeicher ist auf der EduPage2-Serverinstanz, mit der Sie sich verbinden, deaktiviert.
sk: Ukladanie dát na serveri je zakázané na inštancii servera EduPage2, ku ktorej sa pripájate.

# setupDataStoragePrivacyEncrypted
source: Your data is encrypted
de: Ihre Daten SInd verschlüsselt
sk: Tvoje dáta sú šifrované

# setupDataStoragePrivacyUnencrypted
source: Your data is not encrypted
de: Ihre Daten sind nicht verschlüsselt
sk: Tvoje dáta nie sú šifrované

# setupDataStoragePrivacyDetailsEncrypted
source: The server that you are connecting to stores your credentials in a secure and encrypted manner.
de: Der Server, mit dem Sie sich verbinden, speichert Ihre Anmeldedaten auf sichere und verschlüsselte Weise
sk: Server ku ktorému sa pripájaš ukladá tvoje prihlasovacie údaje bezpečne a šifrovane.

# setupDataStorageEnable
source: Enable Data Storage
sk: Povoliť ukladanie dát

# setupDataStorageChoose
source: Choose what data to store
sk: Vyber dáta, ktoré sa budú ukladať

# setupDataStorageAttendance
source: User login credentials
sk: Prihlasovacie údaje

# setupDataStorageGrades
source: Text message storage
sk: Úložisko textových správ

# setupDataStoragePrivacy
source: EduPage2 Data Storage Security
sk: Bezpečnosť úložiska dát EduPage2

# setupDataStorageMessages
source: Timeline storage
sk: Ukladanie rozvrhov

# setupFeaturesAvailable
source: Working features
sk: Dostupné funkcie

# setupFeatureBasic
source: Basic app functionality (messages, timetables, grades, ...)
sk: Základné funkcie aplikácie (správy, rozvrhy, známky, ...)

# setupFeatureNotifications
source: Push notificatons
sk: Push notifikácie

# setupCompleteTitle
source: Setup Complete
sk: Nastavenie je dokončené

# setupCompleteBody
source: Your setup is complete. You can now start using EduPage2.
sk: Tvoje nastavenie je dokončené. Teraz môžeš začať používať EduPage2.

source: Setup Done
sk: Nastavenie dokončené

# homeOnboarding
source: Onboarding
de: Einführung
